ОБУЧЕНИЕ/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ОбъемыПродаж</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборСвойств</name>
      <type>
        <types>CatalogRef.ВариантыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРеализации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОБУЧЕНИЕ/src/Documents/РеализацияТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.ЦенаРеализации = ОпределитьЦенаРеализации(Элементы.Товары.ТекущиеДанные.Номенклатура);
	Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации; 

КонецПроцедуры

&НаСервере
Функция ОпределитьЦенаРеализации(Номенклатура)
	
	Возврат Номенклатура.ЦенаРеализации;	

КонецФункции

&НаКлиенте
Процедура ТоварыЦенаРеализацииПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации; 

 КонецПроцедуры

&НаКлиенте
 Процедура ТоварыКоличествоТовараПриИзменении(Элемент)
	 
	 Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации;
	 
 КонецПроцедуры
